/* меню при нажатии data parent */
// import './and-JS/data-parent'
//---------------------------------------------------------------------------------------------------------------------
// dynamic adapt зделан для тово штоб при достиганий max width в css блок с кодом переносится в любую часть
// html работает както так (<div data-da=".куда хотим перенести, при максимальной или минимальной ширине (991.98),
// значение каким номером он там будет типо order, необезательно(1)" class="любой клас"></div>)

// import './and-JS/dynamic-adapt'

//---------------------------------------------------------------------------------------------------------------------
// библлиотека для кросивова ползунка
// в letsGO указиваем класи и настройки
// import './and-JS/nouslider'
// import './and-JS/nouslider-letsGO'

//---------------------------------------------------------------------------------------------------------------------
// для красивово select html атрибута
//  писать следующим оброзом(
//    <select class='select' name='language'>
//       <option disabled>По популярности</option>
//       <option value='HTML'>по популярности</option>
//       <option value='JavaScript'>по популярности</option>
//       <option value='PHP'>по популярности</option>
//    </select>
//  )
// import "./and-JS/selection"
//---------------------------------------------------------------------------------------------------------------------

// красивий слайдер с множеством возможностей
// в html написать (<script src="https://cdn.jsdelivr.net/npm/swiper@8/swiper-bundle.min.js"></script>)
// штоб использивать написать структуру (
//    <div class='new-product__slider swiper'>
//       <div class='new-product__swipper swiper-wrapper'>
//          <div class='new-product__slide swiper-slide'>
//             <img src='' alt='Картинка'>
//          </div>
//       </div>
//    </div>
// )
// import './and-JS/slider-swiper'
//---------------------------------------------------------------------------------------------------------------------
// timer
// штоб использивать написать структуру (
//      <span id="hours">11 </span><span id="minutes"> 59</span><span id="second">00</span>
// )
// import './and-JS/timer'
//---------------------------------------------------------------------------------------------------------------------

//для всево остольнова
// import './and-JS/script'